Extensions/нп_КонтрольПроведенияПоДО/src/InformationRegisters/нп_НастройкиКонтроляПроведенияПоДО/нп_НастройкиКонтроляПроведенияПоДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>нп_НастройкиКонтроляПроведенияПоДО</name>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <resources>
    <name>КонтролироватьПроведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Extensions/нп_КонтрольПроведенияПоДО/src/Enums/нп_ВидыСтрокУчастниковКонтроля/нп_ВидыСтрокУчастниковКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>нп_ВидыСтрокУчастниковКонтроля</name>
  <enumValues>
    <name>Включая</name>
  </enumValues>
  <enumValues>
    <name>Исключая</name>
  </enumValues>
</mdclass:Enum>

Extensions/нп_КонтрольПроведенияПоДО/src/InformationRegisters/нп_НастройкиКонтроляПроведенияПоДО/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораДокументов();
	ОбновитьДоступныеПоляОтбора();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДоступныеПоляОтбора();
	ЗагрузитьОтборИзОбъекта(ТекущийОбъект);
	ЗагрузитьУчастниковИзОбъекта(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОтборПоРеквизитам = Новый ХранилищеЗначения(КомпоновщикОтбора.Настройки);
	ТекущийОбъект.УчастникиКонтроля = Новый ХранилищеЗначения(ТаблицаУчастниковВЗначение());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолноеИмяОбъектаМетаданныхПриИзменении(Элемент)
	
	ОбновитьДоступныеПоляОтбора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

&НаКлиенте
Процедура УчастникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Или Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВключаяИсключая) Тогда
		ТекущиеДанные.ВключаяИсключая = ПредопределенноеЗначение(
			"Перечисление.нп_ВидыСтрокУчастниковКонтроля.Включая");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораДокументов()
	
	Элементы.ПолноеИмяОбъектаМетаданных.СписокВыбора.Очистить();
	
	Для Каждого ЭлементСписка Из нп_КонтрольПроведенияПоСогласованиюДО.СписокДокументовДляВыбора() Цикл
		Элементы.ПолноеИмяОбъектаМетаданных.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступныеПоляОтбора()
	
	ПолноеИмя = Запись.ПолноеИмяОбъектаМетаданных;
	Если ПустаяСтрока(ПолноеИмя) Тогда
		КомпоновщикОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
		Возврат;
	КонецЕсли;
	
	СнимокНастроек = Неопределено;
	Если нп_КонтрольПроведенияПоСогласованиюДОКлиентСервер.ЕстьАктивныеЭлементыОтбора(КомпоновщикОтбора.Настройки.Отбор) Тогда
		СнимокНастроек = Новый ХранилищеЗначения(КомпоновщикОтбора.Настройки);
	КонецЕсли;
	
	Схема = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = Схема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "ОсновнойНабор";
	НаборДанных.Запрос = "ВЫБРАТЬ * ИЗ " + ПолноеИмя + " КАК ОсновнаяТаблица";
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	Схема.ПоляИтога.Очистить();
	
	АдресСхемы = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикОтбора.Инициализировать(Источник);
	
	Если СнимокНастроек <> Неопределено Тогда
		Попытка
			КомпоновщикОтбора.ЗагрузитьНастройки(СнимокНастроек.Получить());
		Исключение
			// оставляем пустой отбор после смены типа
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОтборИзОбъекта(ТекущийОбъект)
	
	ОтборПоРеквизитам = ТекущийОбъект.ОтборПоРеквизитам;
	Если Не ЗначениеЗаполнено(ОтборПоРеквизитам) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СохраненныеНастройки = ОтборПоРеквизитам.Получить();
		Если ТипЗнч(СохраненныеНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
			КомпоновщикОтбора.ЗагрузитьНастройки(СохраненныеНастройки);
		КонецЕсли;
	Исключение
		// повреждённое хранилище — оставляем пустой отбор
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУчастниковИзОбъекта(ТекущийОбъект)
	
	Участники.Очистить();
	
	Хранилище = ТекущийОбъект.УчастникиКонтроля;
	Если Не ЗначениеЗаполнено(Хранилище) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗначениеХранилища = Хранилище.Получить();
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(ЗначениеХранилища) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ЗначениеХранилища Цикл
		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Участник = СтрокаТаблицы.Участник;
		НоваяСтрока.ВключаяИсключая = ВидСтрокиУчастникаИзХранилища(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаУчастниковВЗначение()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Участник");
	Результат.Колонки.Добавить("ВидСтроки"); // совместимость с ранним форматом
	Результат.Колонки.Добавить("ВключаяИсключая");
	
	Для Каждого СтрокаФормы Из Участники Цикл
		Если Не ЗначениеЗаполнено(СтрокаФормы.Участник) Тогда
			Продолжить;
		КонецЕсли;
		ВидСтроки = СтрокаФормы.ВключаяИсключая;
		Если Не ЗначениеЗаполнено(ВидСтроки) Тогда
			ВидСтроки = Перечисления.нп_ВидыСтрокУчастниковКонтроля.Включая;
		КонецЕсли;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Участник = СтрокаФормы.Участник;
		НоваяСтрока.ВидСтроки = ВидСтроки;
		НоваяСтрока.ВключаяИсключая = ВидСтроки;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидСтрокиУчастникаИзХранилища(СтрокаТаблицы)
	
	Если СтрокаТаблицы.Владелец().Колонки.Найти("ВключаяИсключая") <> Неопределено
		И ЗначениеЗаполнено(СтрокаТаблицы.ВключаяИсключая) Тогда
		Возврат СтрокаТаблицы.ВключаяИсключая;
	КонецЕсли;
	
	Если СтрокаТаблицы.Владелец().Колонки.Найти("ВидСтроки") <> Неопределено
		И ЗначениеЗаполнено(СтрокаТаблицы.ВидСтроки) Тогда
		Возврат СтрокаТаблицы.ВидСтроки;
	КонецЕсли;
	
	Возврат Перечисления.нп_ВидыСтрокУчастниковКонтроля.Включая;
	
КонецФункции

#КонецОбласти
